<template>
  <el-card class="blog-detail">
    <div slot="header">
      <div class="date-view">
        <i class="el-icon-date">{{ idDetail.create_time }}</i>
        <i class="el-icon-view">{{ idDetail.views }}</i>
        <i class="el-icon-star-off">{{ idDetail.views }}</i>
        <i class="el-icon-chat-dot-round">{{ idDetail.views }}</i>
      </div>
    </div>
    <img :src="idDetail.first_picture" class="image" />
    <el-divider />
    <div class="content">
      <div v-html="idDetail.content" />
      <br />
      <p>
        腊月一到，年就来了，如果用一种颜色来形容腊月，那么“红”字，就可以代表一切。儿时，有一种红随处可见，那是家家户户窗户上贴着的“福”字，还有门口贴着的对联。那红，一看就让人感受到喜庆！
        腊月是红色的，日子也是越过越红火的。每到新年来临之际，母亲总是会对我们几个晚辈轻声念叨：“到底是生活条件好了，日子好过了，你们可得珍惜这好日子。”的确，对于母亲这一辈人来说，她们那时过年，正处于物资匮乏时期，远不能与我们现在相比。
        母亲说那时过年，能吃上几顿带肉的饺子就不错了。物资的匮乏让她们那一代人，即使是在新年都不如我们平常的日子好。以至于现在日子过好了，母亲总会一再地提醒我们不要浪费粮食，不要忘本，凡事都要知足，不能心存不满。
        腊月里母亲会买一些红灯笼挂在阳台上，每一年都会在腊月的时候，换下去年的红灯笼。这红红的灯笼，寓意着日子一天天地红红火火。这红看起来就让人满心欣喜，看起来就觉得心生温暖。
        这让我不由得想起有一年正值腊月，我从外地往家赶。火车上坐在我对面的一位老妇人，带着孙女一起去城里女儿家过年。老妇人跟我聊天，聊到最后，她从口袋里摸出了两张窗花，笑着对我说这是她在家里剪的窗花，想拿到城里贴在女儿家，因与我聊天投缘，便要送两张给我。
        窗花拿在手上，细看是几条栩栩如生的鱼。老妇人对我说，那叫年年有鱼。拿着窗花，看着她的笑容，我觉得很温暖。那红红的窗花，还有来自陌生人的祝福，让我觉得那年的新年很有意义，每每想起，仍备感温暖。
        如今只要见到窗花，我总能想起那位老妇人，想起那一年在火车上的情形，想起她和蔼可亲的模样，想起那一抹红，还会联想到在这个红火的腊月里，又有多少在外漂泊的人正在赶路回家与家人团聚，红红火火地过大年。
        一年一年，腊月来了又走；一年一年，日子越过越好。这红红的腊月，让人心生温暖，让人心怀希望；这红红的腊月，让我憧憬未来，同时也时刻提醒自己：珍惜这来之不易的好日子。
      </p>
      <p>
        腊月一到，年就来了，如果用一种颜色来形容腊月，那么“红”字，就可以代表一切。儿时，有一种红随处可见，那是家家户户窗户上贴着的“福”字，还有门口贴着的对联。那红，一看就让人感受到喜庆！
        腊月是红色的，日子也是越过越红火的。每到新年来临之际，母亲总是会对我们几个晚辈轻声念叨：“到底是生活条件好了，日子好过了，你们可得珍惜这好日子。”的确，对于母亲这一辈人来说，她们那时过年，正处于物资匮乏时期，远不能与我们现在相比。
        母亲说那时过年，能吃上几顿带肉的饺子就不错了。物资的匮乏让她们那一代人，即使是在新年都不如我们平常的日子好。以至于现在日子过好了，母亲总会一再地提醒我们不要浪费粮食，不要忘本，凡事都要知足，不能心存不满。
        腊月里母亲会买一些红灯笼挂在阳台上，每一年都会在腊月的时候，换下去年的红灯笼。这红红的灯笼，寓意着日子一天天地红红火火。这红看起来就让人满心欣喜，看起来就觉得心生温暖。
        这让我不由得想起有一年正值腊月，我从外地往家赶。火车上坐在我对面的一位老妇人，带着孙女一起去城里女儿家过年。老妇人跟我聊天，聊到最后，她从口袋里摸出了两张窗花，笑着对我说这是她在家里剪的窗花，想拿到城里贴在女儿家，因与我聊天投缘，便要送两张给我。
        窗花拿在手上，细看是几条栩栩如生的鱼。老妇人对我说，那叫年年有鱼。拿着窗花，看着她的笑容，我觉得很温暖。那红红的窗花，还有来自陌生人的祝福，让我觉得那年的新年很有意义，每每想起，仍备感温暖。
        如今只要见到窗花，我总能想起那位老妇人，想起那一年在火车上的情形，想起她和蔼可亲的模样，想起那一抹红，还会联想到在这个红火的腊月里，又有多少在外漂泊的人正在赶路回家与家人团聚，红红火火地过大年。
        一年一年，腊月来了又走；一年一年，日子越过越好。这红红的腊月，让人心生温暖，让人心怀希望；这红红的腊月，让我憧憬未来，同时也时刻提醒自己：珍惜这来之不易的好日子。
      </p>
      <p>
        腊月一到，年就来了，如果用一种颜色来形容腊月，那么“红”字，就可以代表一切。儿时，有一种红随处可见，那是家家户户窗户上贴着的“福”字，还有门口贴着的对联。那红，一看就让人感受到喜庆！
        腊月是红色的，日子也是越过越红火的。每到新年来临之际，母亲总是会对我们几个晚辈轻声念叨：“到底是生活条件好了，日子好过了，你们可得珍惜这好日子。”的确，对于母亲这一辈人来说，她们那时过年，正处于物资匮乏时期，远不能与我们现在相比。
        母亲说那时过年，能吃上几顿带肉的饺子就不错了。物资的匮乏让她们那一代人，即使是在新年都不如我们平常的日子好。以至于现在日子过好了，母亲总会一再地提醒我们不要浪费粮食，不要忘本，凡事都要知足，不能心存不满。
        腊月里母亲会买一些红灯笼挂在阳台上，每一年都会在腊月的时候，换下去年的红灯笼。这红红的灯笼，寓意着日子一天天地红红火火。这红看起来就让人满心欣喜，看起来就觉得心生温暖。
        这让我不由得想起有一年正值腊月，我从外地往家赶。火车上坐在我对面的一位老妇人，带着孙女一起去城里女儿家过年。老妇人跟我聊天，聊到最后，她从口袋里摸出了两张窗花，笑着对我说这是她在家里剪的窗花，想拿到城里贴在女儿家，因与我聊天投缘，便要送两张给我。
        窗花拿在手上，细看是几条栩栩如生的鱼。老妇人对我说，那叫年年有鱼。拿着窗花，看着她的笑容，我觉得很温暖。那红红的窗花，还有来自陌生人的祝福，让我觉得那年的新年很有意义，每每想起，仍备感温暖。
        如今只要见到窗花，我总能想起那位老妇人，想起那一年在火车上的情形，想起她和蔼可亲的模样，想起那一抹红，还会联想到在这个红火的腊月里，又有多少在外漂泊的人正在赶路回家与家人团聚，红红火火地过大年。
        一年一年，腊月来了又走；一年一年，日子越过越好。这红红的腊月，让人心生温暖，让人心怀希望；这红红的腊月，让我憧憬未来，同时也时刻提醒自己：珍惜这来之不易的好日子。
      </p>
      <p>
        腊月一到，年就来了，如果用一种颜色来形容腊月，那么“红”字，就可以代表一切。儿时，有一种红随处可见，那是家家户户窗户上贴着的“福”字，还有门口贴着的对联。那红，一看就让人感受到喜庆！
        腊月是红色的，日子也是越过越红火的。每到新年来临之际，母亲总是会对我们几个晚辈轻声念叨：“到底是生活条件好了，日子好过了，你们可得珍惜这好日子。”的确，对于母亲这一辈人来说，她们那时过年，正处于物资匮乏时期，远不能与我们现在相比。
        母亲说那时过年，能吃上几顿带肉的饺子就不错了。物资的匮乏让她们那一代人，即使是在新年都不如我们平常的日子好。以至于现在日子过好了，母亲总会一再地提醒我们不要浪费粮食，不要忘本，凡事都要知足，不能心存不满。
        腊月里母亲会买一些红灯笼挂在阳台上，每一年都会在腊月的时候，换下去年的红灯笼。这红红的灯笼，寓意着日子一天天地红红火火。这红看起来就让人满心欣喜，看起来就觉得心生温暖。
        这让我不由得想起有一年正值腊月，我从外地往家赶。火车上坐在我对面的一位老妇人，带着孙女一起去城里女儿家过年。老妇人跟我聊天，聊到最后，她从口袋里摸出了两张窗花，笑着对我说这是她在家里剪的窗花，想拿到城里贴在女儿家，因与我聊天投缘，便要送两张给我。
        窗花拿在手上，细看是几条栩栩如生的鱼。老妇人对我说，那叫年年有鱼。拿着窗花，看着她的笑容，我觉得很温暖。那红红的窗花，还有来自陌生人的祝福，让我觉得那年的新年很有意义，每每想起，仍备感温暖。
        如今只要见到窗花，我总能想起那位老妇人，想起那一年在火车上的情形，想起她和蔼可亲的模样，想起那一抹红，还会联想到在这个红火的腊月里，又有多少在外漂泊的人正在赶路回家与家人团聚，红红火火地过大年。
        一年一年，腊月来了又走；一年一年，日子越过越好。这红红的腊月，让人心生温暖，让人心怀希望；这红红的腊月，让我憧憬未来，同时也时刻提醒自己：珍惜这来之不易的好日子。
      </p>
      <p>
        腊月一到，年就来了，如果用一种颜色来形容腊月，那么“红”字，就可以代表一切。儿时，有一种红随处可见，那是家家户户窗户上贴着的“福”字，还有门口贴着的对联。那红，一看就让人感受到喜庆！
        腊月是红色的，日子也是越过越红火的。每到新年来临之际，母亲总是会对我们几个晚辈轻声念叨：“到底是生活条件好了，日子好过了，你们可得珍惜这好日子。”的确，对于母亲这一辈人来说，她们那时过年，正处于物资匮乏时期，远不能与我们现在相比。
        母亲说那时过年，能吃上几顿带肉的饺子就不错了。物资的匮乏让她们那一代人，即使是在新年都不如我们平常的日子好。以至于现在日子过好了，母亲总会一再地提醒我们不要浪费粮食，不要忘本，凡事都要知足，不能心存不满。
        腊月里母亲会买一些红灯笼挂在阳台上，每一年都会在腊月的时候，换下去年的红灯笼。这红红的灯笼，寓意着日子一天天地红红火火。这红看起来就让人满心欣喜，看起来就觉得心生温暖。
        这让我不由得想起有一年正值腊月，我从外地往家赶。火车上坐在我对面的一位老妇人，带着孙女一起去城里女儿家过年。老妇人跟我聊天，聊到最后，她从口袋里摸出了两张窗花，笑着对我说这是她在家里剪的窗花，想拿到城里贴在女儿家，因与我聊天投缘，便要送两张给我。
        窗花拿在手上，细看是几条栩栩如生的鱼。老妇人对我说，那叫年年有鱼。拿着窗花，看着她的笑容，我觉得很温暖。那红红的窗花，还有来自陌生人的祝福，让我觉得那年的新年很有意义，每每想起，仍备感温暖。
        如今只要见到窗花，我总能想起那位老妇人，想起那一年在火车上的情形，想起她和蔼可亲的模样，想起那一抹红，还会联想到在这个红火的腊月里，又有多少在外漂泊的人正在赶路回家与家人团聚，红红火火地过大年。
        一年一年，腊月来了又走；一年一年，日子越过越好。这红红的腊月，让人心生温暖，让人心怀希望；这红红的腊月，让我憧憬未来，同时也时刻提醒自己：珍惜这来之不易的好日子。
      </p>
    </div>
    <br>
    <el-divider> <el-button type="primary" icon="el-icon-star-off" circle></el-button></el-divider>
  </el-card>
</template>

<script>
export default {
  name: "BlogDetail",
  props: {
    idDetail: {
      type: Object,
      default() {
        return {
          create_time: "2020/01/01",
          views: "1024",
          first_picture: "#",
          content: "你好"
        };
      }
    }
  }
};
</script>

<style scoped>
.date-view i {
  margin-right: 30px;
  color: gray;
}

.image {
  width: 960px;
  height: 600px;
  border-radius: 5px;
}

.blog-detail {
  margin-bottom: 100px;
}

.content {
  margin: 20px 30px;
}
</style>
